In [1]:
import numpy as np
import pandas as pd

In [2]:
np.nan==np.nan

False

In [3]:
np.nan is np.nan

True

In [4]:
cd ..

G:\Mes Documents\Documents\Python\Udemy-Python-for-Machine-Learning-and-Data-Science-Masterclass

In [5]:
ls

 Le volume dans le lecteur G s'appelle Disque dur
 Le num‚ro de s‚rie du volume est B2F9-88D2

 R‚pertoire de G:\Mes Documents\Documents\Python\Udemy-Python-for-Machine-Learning-and-Data-Science-Masterclass

19/12/2020  12:46    <DIR>          .
19/12/2020  12:46    <DIR>          ..
19/12/2020  11:06    <DIR>          .ipynb_checkpoints
19/12/2020  09:36    <DIR>          Notes
19/12/2020  09:47               221 requirements.txt
19/12/2020  12:46    <DIR>          Section03-NumPy
19/12/2020  12:23    <DIR>          Section04-NumPy
21/12/2020  13:26    <DIR>          Section05-Pandas
19/12/2020  11:02               122 specify_env_from_terminal.txt
               2 fichier(s)              343 octets
               7 R‚p(s)  18ÿ319ÿ904ÿ768 octets libres

In [6]:
cd Notes/

G:\Mes Documents\Documents\Python\Udemy-Python-for-Machine-Learning-and-Data-Science-Masterclass\Notes

In [7]:
cd 03-Pandas/

G:\Mes Documents\Documents\Python\Udemy-Python-for-Machine-Learning-and-Data-Science-Masterclass\Notes\03-Pandas

In [8]:
import os
os.getcwd()

'G:\\Mes Documents\\Documents\\Python\\Udemy-Python-for-Machine-Learning-and-Data-Science-Masterclass\\Notes\\03-Pandas'

In [9]:
filepath=os.getcwd()

In [10]:
cd ..

G:\Mes Documents\Documents\Python\Udemy-Python-for-Machine-Learning-and-Data-Science-Masterclass\Notes

In [11]:
cd ..

G:\Mes Documents\Documents\Python\Udemy-Python-for-Machine-Learning-and-Data-Science-Masterclass

In [12]:
cd Section05-Pandas/

G:\Mes Documents\Documents\Python\Udemy-Python-for-Machine-Learning-and-Data-Science-Masterclass\Section05-Pandas

In [13]:
ls

 Le volume dans le lecteur G s'appelle Disque dur
 Le num‚ro de s‚rie du volume est B2F9-88D2

 R‚pertoire de G:\Mes Documents\Documents\Python\Udemy-Python-for-Machine-Learning-and-Data-Science-Masterclass\Section05-Pandas

21/12/2020  13:26    <DIR>          .
21/12/2020  13:26    <DIR>          ..
21/12/2020  13:10    <DIR>          .ipynb_checkpoints
21/12/2020  11:31           171ÿ488 data frame.ipynb
21/12/2020  13:26             1ÿ355 missing data.ipynb
19/12/2020  13:56           608ÿ722 series.ipynb
21/12/2020  12:43           132ÿ957 useful methods.ipynb
               4 fichier(s)          914ÿ522 octets
               3 R‚p(s)  18ÿ319ÿ904ÿ768 octets libres

In [15]:
df = pd.read_csv(filepath+'\\movie_scores.csv')

In [16]:
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [17]:
df.isnull()

   first_name  last_name    age    sex  pre_movie_score  post_movie_score
0       False      False  False  False            False             False
1        True       True   True   True             True              True
2       False      False  False  False             True              True
3       False      False  False  False            False             False
4       False      False  False  False            False             False

In [18]:
df[df['pre_movie_score'].notnull()]

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [19]:
df[df['pre_movie_score'].isnull()]

  first_name last_name   age  sex  pre_movie_score  post_movie_score
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN

In [25]:
df.dropna(thresh=0)

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [33]:
df.dropna(thresh=1)

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
2       Hugh   Jackman  51.0   m              NaN               NaN
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [27]:
df.dropna()

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [28]:
df.dropna(thresh=2)

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
2       Hugh   Jackman  51.0   m              NaN               NaN
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [29]:
df.dropna(thresh=3)

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
2       Hugh   Jackman  51.0   m              NaN               NaN
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [30]:
df.dropna(thresh=4)

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
2       Hugh   Jackman  51.0   m              NaN               NaN
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [32]:
df.dropna(thresh=5)

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [34]:
df.fillna('AAAAA')

  first_name last_name    age    sex pre_movie_score post_movie_score
0        Tom     Hanks     63      m               8               10
1      AAAAA     AAAAA  AAAAA  AAAAA           AAAAA            AAAAA
2       Hugh   Jackman     51      m           AAAAA            AAAAA
3      Oprah   Winfrey     66      f               6                8
4       Emma     Stone     31      f               7                9